<style>
    h4{
        font-size:1em;
    }
    h5{
        font-size:0.8em;
    }
    table{
        width: 100%;
        border-collapse: collapse;
    }
    thead tr td{
        background:#e7e7e7;
        font-size: 0.8rem;
        font-weight: bold;
        padding: 5px 10px;
        text-align: center;
    }
    td{
        font-size:0.8em;
        font-weight: 300;
    }
    strong{
        font-weight: bold;
    }
    .underline{
        text-decoration: underline;
    }
    .pad5{
        padding: 5px;
    }
    .pb5{
        padding-bottom: 5px;
    }
    body, p, li{
        font-size: 0.9rem;
    }
    .font-bold{
        font-weight: bold;
    }
    .list-number{
        list-style: decimal;
    }
    .list-alpha{
        list-style: lower-alpha;
    }
    .dot-line{
        border-top:1px dotted #000;
        margin-top: 50px;
        padding-top: 5px;
        display:inline;
    }
    .row{
        display: block;
        width: 100%;
        overflow: hidden;
    }
    .col-md-6{
        float: left;
        width: 50%;
        margin: 0;
        padding: 0;
    }
</style>

<p>
    {{--Date: <br>--}}
    {{--SRCIL/HRD/{{$employee->user_code}}--}}

    তারিখ : {{!empty($employee->date_of_confirmation)? toDated($employee->date_of_confirmation):'N/A'}}<br/>
    ব্যক্তিগত ও গোপনীয়<br>
    জনাব/জনাবা : <strong>Mr. {{$employee->name??'N/A'}} </strong><br/>
    পিতার নাম :{{$employee->father_name}}<br/>
    মাতার নাম :{{$employee->mother_name}}<br/>
    স্বামী/স্ত্রীর নাম :{{$employee->spouse_name}}<br/>
    স্থায়ী ঠিকানা :{{$employee->present_address_line.",".$employee->present_district.",".$employee->present_thana}}<br/>
    বর্তমান ঠিকানা:{{$employee->permanent_address_line.",".$employee->permanent_district.",".$employee->permanent_thana}}<br/>
    নিয়োগপত্র

</p>


<p>
    সম্মানিত জনাব/জনাবা <br/>
    আনন্দের সাথে জানাচ্ছি যে আপনাকে <strong>{{$employee->company_name}}</strong>-এ বিক্রয় প্রতিনিধি পদে নিযুক্ত করা হয়েছে। আপনাকে <strong>{{toDated($employee->date_of_confirmation)}}</strong> তারিখে নিম্নলিখিত চুক্তি ও শর্তাবলী সাপেক্ষে কাজে যোগদান করার জন্য অনুরোধ জানানো হচ্ছেঃ

    {{--{{$employee->designations_name ?? 'N/A'}} <br>--}}
    {{--{{$employee->departments_name ?? 'N/A'}} <br>--}}
    {{--SR Chemical Industries Ltd. <br>--}}
    {{--SR Group <br><br>--}}
</p>
<p>
    ১.আপনার পদের নির্ধারিত দায়িত্ব পালন ছাড়াও প্রয়োজনে বিভিন্ন সময়ে আপনার ওপর অর্পিত কোনো দায়িত্ব পালনে আপনি অঙ্গীকারবদ্ধ। পূর্ববর্তী পালনকৃত কোনো চাকরি বা দায়িত্বের সঙ্গে এটি সম্পর্কযুক্ত নয়। আপনাকে অবগত করা যাচ্ছে যে আপনার নিয়োগপ্রাপ্তির তারিখ থেকে পরবর্তী ৩ মাস শিক্ষানবীসকালীন সময়সীমা হিসেবে গণ্য হবে। শিক্ষানবীসকালীন সময় সাফল্যের সাথে উত্তীর্ণ হওয়া সাপেক্ষে আপনাকে ডিস্ট্রিবিউশন হাউজে স্থায়ী কর্মচারী হিসেবে নিয়োগ দেয়া হবে। শ্রমিক আইন অনুযায়ী নিয়োগপ্রাপ্তির পরপরই আপনাকে ডিস্ট্রিবিউশন হাউজ কর্তৃক পরিচয়পত্র প্রদান করা হবে।
</p>
<p>
    ২.আপনার মাসিক পারিশ্রমিকের পরিমাণ সর্বসাকুল্যে <strong>{{number_format($employee->min_gross, 2)}}</strong> ({{number_to_words($employee->min_gross)}}) টাকা। বাৎসরিক পারিশ্রমিক বৃদ্ধির পরিমাণ ডিস্ট্রিবিউশন হাউজের নীতি এবং আপনার কর্মদক্ষতা অনুযায়ী নির্ধারিত হবে। আপনার পারিশ্রমিক থেকে আয়কর অধ্যাদেশ ১৯৮৪ অনুযায়ী আয়করের অংশটুকু কেটে রাখা হবে।
    <br/>
    আপনার বেতন ভাতার বিস্তারিত বিবরণ নিচে দেয়া হলো: <br/>
    @if(count($salary_components) > 0)
        <ul>
        @foreach($salary_components as $val)
            <li>{{$val->component_name}} : {{number_format($val->addition_amount, 2)}}</li>
        @endforeach
        </ul>
    @endif
    {{--ক) মূল বেতন --- টাকা<br/>--}}
    {{--খ) যাতায়াত ভাতা --- টাকা<br/>--}}
    {{--গ) বাড়ি ভাড়া ভাতা --- টাকা<br/>--}}
</p>
<p>
    ৩. অন্যান্য ভাতা --- বাংলাদেশের শ্রমিক আইন অনুযায়ী অন্যান্য ভাতা নির্ধারণ করা হবে।
</p>
<p>
    ৪.আপনি বার্ষিক দুইটি উৎসব ভাতা উপভোগ করবেন। প্রতিটি উৎসব ভাতা প্রতি মাসের মূল বেতনের বেশি হবে না। এই উৎসব ভাতার প্রতিটি প্রতি ঈদে একটি করে দেয়া হবে। উৎসব ভাতা অনির্দিষ্ট সময়কাল পর্যন্ত বহাল থাকবে।
</p>
<p>
    ৫.ডিস্ট্রিউিবশন হাউজের নীতি ও চুক্তি মোতাবেক কর্তৃপক্ষের অনুমোদন সাপেক্ষে আপনি বাৎসরিক ও সরকারী ছুটি প্রাপ্য হবেন। শ্রমিক আইন অনুযায়ী সাপ্তাহিক ছুটি ছাড়াও আপনি বার্ষিক, অসুস্থতাজনিত ছুটি, উৎসব ছুটি ও মাতৃত্বকালীন ছুটি প্রাপ্য হবেন।
</p>
<p>
    ৬.ডিস্ট্রিবিউশন হাউজ যেকোনো সময় আপনাকে চাকরি থেকে অব্যাহতি দেয়ার অধিকার রাখে। তবে ডিস্ট্রিবিউশন হাউজ এক্ষেত্রে ৬০ দিনের আগাম বিজ্ঞপ্তি অথবা তার পরিবর্তে দুই মাসের বেতন পরিশোধ করতে বাধ্য থাকবে। আপনি ৩০ দিনের নোটিশ বা এক মাসের পারিশ্রমিক প্রদান সাপেক্ষে চাকরি পদত্যাগ করতে পারবেন।
</p>
<p>
    ৭.যেকোন কর্মীকে শৃঙ্খলাভঙ্গের ক্ষেত্রে জবাবদিহি করতে হতে পারে এবং কোন নোটিশ ছাড়াই অব্যাহতি দেওয়া হবে, যদিঃ<br/>
    ক) কোন বেআইনি কাজে সম্পৃক্ততা থাকলে<br/>
    খ) শ্রমিক আইন, নিয়োগদাতা গাইডলাইন বা আচরণবিধি অনুযায়ী কোন অসদুপায় অবলম্বন করলে<br/>
</p>
<p>
    ৮. আপনি প্রত্যক্ষ বা পরোক্ষভাবে ডিস্ট্রিবিউশন হাউজে আপনার কর্মকালীন কোনো সম্পত্তি সংক্রান্ত বা ব্যবসা-বাণিজ্য সংক্রান্ত কোনো তথ্য কোন ব্যক্তি বা প্রতিষ্ঠানের কাছে ফাঁস করতে পারবেন না। আপনার অবহেলায় যেকোনো ধরনের ক্ষয়ক্ষতি বা অনিয়মের দায়দায়িত্বও সম্পূর্ণ আপনার। এছাড়াও<br/>
    ক) আপনি সম্পূর্ণ নিঃশর্তভাবে ডিস্ট্রিবিউশন হাউজে কিংবা এর কোনো বাণিজ্যিক অংশীদারদের কাছে আপনার কর্মকালীন সময় বা কাজের সাথে সম্পর্কিত কিন্তু সীমাবদ্ধ নয়, আপনার কৃত কোনো কাজের (একক বা দলগত) নকশা, টেক্সট, চিত্র, স্কেচ, ড্রয়িং, ডাটাবেজ, প্রোগ্রাম কোড, প্রোগ্রাম, কাজ, আইডিয়া, আবিষ্কার, উদ্ভাবন, পণ্য, লেখা,  আলোকচিত্র, তালিকা, উপাত্ত, পরিকল্পনা, উপাদান, প্রক্রিয়া, পদ্ধতি, সম্পূর্ণ কার্যপ্রণালী, ডিভাইস, অপারেশন ও তথ্যসহ সবধরনের মেধাসত্ব চাহিবামাত্র সম্পূর্ণরুপে হস্তান্তরে বাধ্য থাকবেন। এই হস্তান্তর ডিস্ট্রিবিউশন হাউজ বা তার নিয়োজিত কোনো ব্যক্তি বা প্রতিষ্ঠানকে প্রয়োজন মাফিক মেধাসত্ব অর্পণ বা কৃত কাজের পরিবর্তনের অধিকার প্রদান করে।<br/>
    খ) আপনি সম্মতি প্রদান করছেন যে ডিস্ট্রিবিউশন হাউজের বা ডিস্ট্রিবিউশন হাউজ নিয়োজিত কারো চাহিদা অনুযায়ী ডিস্ট্রিবিউশন হাউজ বা নিয়োজিত কারো স্বার্থ অক্ষুন্ন রাখতে পূর্ববর্তী কোনো কাজের যেকোনো দলিল বা যুক্তিসঙ্গতভাবে সহায়তা প্রদানে বাধ্য থাকবেন।<br/>
</p>
<p>
    ৯. অন্যান্য নীতি ও শর্তাবলী যা পরিপূর্ণভাবে এই পত্রে উল্লেখ করা হয় নি, তা ডিস্ট্রিবিউশন হাউজের সার্ভিস রুলস এবং অ্যান্ড কোড অব কন্ডাক্ট এর মাধ্যমে পরিচালিত হবে। আপনি এই মর্মে সম্মতি দিচ্ছেন যে, ডিস্ট্রিবিউশন হাউজ আগাম নোটিশ প্রদান সাপেক্ষে সময় সময় এই কোড অব কন্ডাক্ট এবং সার্ভিস রুলস পরিবর্তন, পরিমার্জন কিংবা পরিবর্ধনের অধিকার রাখে।
</p>
<p></p>
<p>
    আমরা অত্যন্ত আনন্দের সাথে আপনাকে ... এর নতুন সদস্য হিসেবে স্বাগত জানাচ্ছি এবং আমরা আশা করছি নতুন এই সম্পর্ক দীর্ঘসময়ের জন্য দুপক্ষের জন্য সুবিধাজনক হবে।
</p>
<p>
    এই পত্রের সকল নীতির সম্মতি সাপেক্ষে আপনাকে এই পত্রটি স্বাক্ষর করতে অনুরোধ জানানো হচ্ছে।<br/>
    এই পত্রটি ইংরেজি ও বাংলা উভয় ভাষায় লেখা হয়েছে। কোন অসঙ্গতি থাকলে ইংরেজি বিবরণকে অনুসরণ করতে অনুরোধ করা হচ্ছে।<br/><br/><br><br><br><br><br>
    ------------------------<br>
    ধন্যবাদ<br/>
    আপনার বিশ্বস্ত<br/>

</p>


